[Killed] EqualityOperator
HW3/src/lib/CoveyTownController.ts:140:62
    * @param location New location for this player
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
-    const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
+    const conversation = this.conversationAreas.find(conv => conv.label !== location.conversationLabel);
     const prevConversation = player.activeConversationArea;
 
killedBy: CoveyTownController destorySession should emit onConversationAreaUpdated to all of the listener
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
HW3/src/lib/CoveyTownController.ts:168:9
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
-    if (conversation.occupantsByID.length === 0) {
+    if (false) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
killedBy: CoveyTownController destorySession should emit onConversationAreaUpdated to all of the listener
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"boundingBox": {"height": 10, "width": 10, "x": 400, "y": 400}, "label": "MWBRlxMXUSY6ew-pLi-OE", "occupantsByID": [], "topic": "ZLPoEXoCSSXnazs9GAz-7"}

Number of calls: 0

[Killed] BlockStatement
HW3/src/lib/CoveyTownController.ts:168:50
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
-    if (conversation.occupantsByID.length === 0) {
-      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
-      this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
-    } else {
+    if (conversation.occupantsByID.length === 0) {} else {
       this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
     }
killedBy: CoveyTownController destorySession should emit onConversationAreaUpdated to all of the listener
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"boundingBox": {"height": 10, "width": 10, "x": 400, "y": 400}, "label": "8Xkj4hKePXW-4mthzqsGw", "occupantsByID": [], "topic": "paQ83IxeTl2oUSbyhWAm8"}

Number of calls: 0

[Killed] ArrowFunction
HW3/src/lib/CoveyTownController.ts:169:72
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
     if (conversation.occupantsByID.length === 0) {
-      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
+      this._conversationAreas.splice(this._conversationAreas.findIndex(() => undefined), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
     } else {
killedBy: CoveyTownController updatePlayerLocation updatePlayerLocation when players move and calls on playerMoved should remove player from conversation area if player moved to another conversationArea
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 7
+ Received  + 5

  Object {
    "boundingBox": Object {
      "height": 10,

[Killed] ConditionalExpression
HW3/src/lib/CoveyTownController.ts:169:80
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
     if (conversation.occupantsByID.length === 0) {
-      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
+      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => true), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
     } else {
killedBy: CoveyTownController updatePlayerLocation updatePlayerLocation when players move and calls on playerMoved should remove players from conversation area if two player left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 4

  Object {
    "boundingBox": Object {
      "height": 10,

[Killed] ConditionalExpression
HW3/src/lib/CoveyTownController.ts:194:9
       eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
     ))
       return false;
-    if (_conversationArea.topic === ''){
+    if (false){
       return false;
     }
killedBy: CoveyTownController addConversationArea should be able to automatically add players if they are in the conversationArea it should not add the empty topic it should add a correct converstaionArea shoul
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
HW3/src/lib/CoveyTownController.ts:219:90
    */
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
     // Helper function to extract the top left (x1,y1) and bottom right corner (x2,y2) of each bounding box
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
+    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width * 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
killedBy: CoveyTownController addConversationArea should be able to automatically add players if they are in the conversationArea it should not add the empty topic it should add a correct converstaionArea shoul
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
HW3/src/lib/CoveyTownController.ts:222:71
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || false || rect2.y1 >= rect1.y2;
     return !noOverlap;
   }
killedBy: CoveyTownController addConversationArea should be able to automatically add players if they are in the conversationArea it should not add the empty topic it should add a correct converstaionArea shoul
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
