[NoCoverage] BooleanLiteral
HW3/src/requestHandlers/CoveyTownRequestHandlers.ts:189:14
   return {
     isOK: success,
     response: {},
-    message: !success
+    message: success
       ? 'Invalid password or update values specified. Please double check your town update password.'
       : undefined,
