[Survived] ObjectLiteral
HW3/src/router/towns.ts:123:15
     } catch (err) {
       logError(err);
       res.status(StatusCodes.INTERNAL_SERVER_ERROR)
-        .json({
-          message: 'Internal server error, please see log in server for more details',
-        });
+        .json({});
     }
   });

[Survived] StringLiteral
HW3/src/router/towns.ts:124:20
       logError(err);
       res.status(StatusCodes.INTERNAL_SERVER_ERROR)
         .json({
-          message: 'Internal server error, please see log in server for more details',
+          message: "",
         });
     }
