[Killed] EqualityOperator
HW3/src/types/Player.ts:58:7
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
+      this.location.x >= conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
killedBy: CoveyTownController addConversationArea should be able to automatically add players if they are in the conversationArea it should not add the empty topic it should add a correct converstaionArea shoul
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
