[Killed] EqualityOperator
HW3/src/types/Player.ts:58:7
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
+      this.location.x <= conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
killedBy: CoveyTownController updatePlayerLocation updatePlayerLocation when players move and calls on playerMoved should change the location of the player
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
